import { StaticImageData } from 'next/image'

import product1 from '/public/goods/1.png'
import product2 from "/public/goods/2.png"
import product3 from "/public/goods/3.jpg"

export interface IGood {
	id: number
	name: string
	producer: string
	price: number
	image: StaticImageData
	description: string
}

export const goodsList: IGood[] = [
	{
		id: 1,
		name: 'Цемент М500 (Д10) ПЦ ІІ/А-Ш-500Р-Н Івано-Франківськ',
		image: product1,
		producer: 'Ifcem Івано-Франківськ',
		price: 140,
		description:
			'Портландцемент ПЦ ІІ/А-Ш-500Р-Н використовується для виготовлення бетону марок 200-600 та для виробництва несучих конструкцій усіх видів будівництва. Бетони, виготовлені на основі цементу ПЦ ІІ/А-Ш-500Р-Н, у порівнянні з бетонами, виготовленими на основі цементу ПЦ І-500Р-Н, характеризуються значно вищою стійкістю до хімічної корозії і меншим тепловиділенням під час монолітного бетонування, що запобігає появі мікротріщин в бетоні та покращує морозостійкість. В порівнянні з бетонами, виготовленими на основі цементу ПЦ ІІ/А-Ш-400Р-Н, бетони, виготовлені на основі ПЦ ІІ/А-Ш-500Р-Н, характеризуються більш високою ранньою міцністю, що дозволяє швидше розбирати опалубки з бетонних конструкцій та продовжувати будівельно-монтажні роботи. Враховуючи переваги цементу ПЦ ІІ/А-Ш-500Р-Н, рекомендується використовувати його для виготовлення бетонів високих марок, якщо потрібно досягти помірного тепловиділення та підвищеної стійкості до хімічної корозії бетонів із високою ранньою міцністю. З бетонами, виготовленими з цієї марки цементу, можна працювати при понижених температурах, забезпечувати відносно пізніше твердіння. Їх успішно використовують для бетонування дорожніх покриттів та виготовлення бруківок. ',
	},
	{
		id: 2,
		name: 'Цемент ПЦ ІІ/А-Ш-500 (Д20)',

		producer: "Кам'янець-Подільський цемент",


		price: 165,
		image: product2,
		description:
			"ПЦ ІІ/А-Ш-500 (Д20) - портландцемент з добавками (клінкер 80-94%, зола виносу 6-20%, мінеральних добавок 0-5%, терміни схоплювання від 3:30 до 4:30 годин). Портландцемент з добавкою золи відрізняється від звичайного портландцементу більш тривалим наростанням міцності і меншою швидкістю твердіння в початковий термін, підвищеної водопотребностью і підвищеною здатністю протистояти руйнівній дії водних середовищ, зниженими тепловиділенням, деформаціями усадки і набрякання, морозостійкістю. Застосовується при виробництві сухих будівельних сумішей, виробництві пенобетонов, виробництві елементів несучих конструкцій (колона, балка, ригель), виробництві будівельного розчину для кам'яної кладки, проведення облицювальних і штукатурних робіт, при проведенні аварійних ремонтних та відновлювальних робіт, будь малоповерхове будівництво, бетонні роботи. Цемент виробляється і фасує на Київському заводі Фомальгаут. Зовнішній вигляд мішка може не відповідати зображенні на сайті. ",
	},
	{
		id: 3,
		name: 'Цемент ПЦ II/А-Ш-500 (Д40)',
		producer: 'Фомальгаут',
		price: 127,
		image: product3,
		description:
			'Найдешевший цемент марки 500. Характерезуется наявністю в своєму складі тонкомолотого доменного шлаку, а також присутністю різних мінеральних добавок, які сприяють поліпшенню фізікомеханіческіх властивостей розчинів приготованих на основі цього цементу. Наявність цих домішок і добавок в цементі призводить до більш тривалих строків схоплювання, меншою динамікою набору міцності і мінімального тепловиділення при його гідратації. Але не дивлячись на це цемент все одно набирає свою міцність, відповідну марці 500, після закінчення 28 суток. Даний вид цементу застосовується для приготування кладок і штукатурних розчинів, зведення не сильно навантажених фундаментів, облаштування армопояс і стяжок, приготування подушки для укладання тротуарної плитки. Цемент виробляється і фасує на Київському заводі Фомальгаут. Зовнішній вигляд мішка може не відповідати зображенні на сайті.',
	},
]
